app/views/static_pages/_home_right_block.html.erb

SELECT  `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1
---
			<% @suggestUsersIds.each do |user_id| %>
				<% @user = User.find_by(id: user_id.id)%>