app/views/likes/create.js.erb

<% @like = Like.where("user_id = ? and micropost_id = ?",
	current_user.id, @micropost.id).first %>
---
SELECT  `likes`.* FROM `likes` WHERE (user_id = 14 and micropost_id = 5) ORDER BY `likes`.`id` ASC LIMIT 1

	);
$("#number-like-<%= @micropost.id %>")
	.html("<%= @micropost.likes.count %> <%='like'.pluralize(@micropost.likes.count) %>");
---
SELECT COUNT(*) FROM `likes` WHERE `likes`.`micropost_id` = 5