app/views/likes/destroy.js.erb

SELECT COUNT(*) FROM `likes` WHERE `likes`.`micropost_id` = 6
---
	);
$("div#number-like-<%= @micropost.id %>")
	.html("<%= @micropost.likes.count %> <%= 'like'.pluralize(@micropost.likes.count) %>");