app/views/users/_content_hided.html.erb

<div class="number-like" style="display: none;">
  <%= micropost.likes.count %>
---
SELECT COUNT(*) FROM `likes` WHERE `likes`.`micropost_id` = 6