app/views/microposts/_comment.html.erb

SELECT  `users`.* FROM `users` WHERE `users`.`id` = 14 LIMIT 1
---
<div class="comment" id="comment-<%= comment.id %>">
  <% @user = User.find_by(id: comment.user_id) %>