app/views/microposts/_like_form.html.erb

<% if current_user.already_like?(micropost) %>
	<% @like = Like.where("user_id = ? and micropost_id = ?", current_user.id, micropost.id).first %>
---
SELECT  `likes`.* FROM `likes` WHERE (user_id = 14 and micropost_id = 6) ORDER BY `likes`.`id` ASC LIMIT 1