app/controllers/admin_controller.rb

SELECT  `users`.* FROM `users` LIMIT 5 OFFSET 0
---
  def index
    if current_user.admin?
      @users = User.all().paginate(page: params[:page], per_page: 5)

SELECT  `users`.* FROM `users` WHERE `users`.`id` = 2 LIMIT 1
UPDATE `users` SET `block` = 1, `updated_at` = '2017-12-27 04:53:11' WHERE `users`.`id` = 2
---
  def block
    @user = User.find(params[:id])
    if @user.block == 0

      @user.block = 1
      @user.save!