app/controllers/microposts_controller.rb

	def create
		@micropost = current_user.microposts.build(micropost_params)
		if @micropost.save
---
INSERT INTO `microposts` (`content`, `user_id`, `created_at`, `updated_at`, `picture`) VALUES ('asdasdasd', 15, '2017-12-27 03:16:32', '2017-12-27 03:16:32', 'img-default.jpg')

	def show
	   @micropost = Micropost.find_by(id: params[:id])
---
SELECT  `microposts`.* FROM `microposts` WHERE `microposts`.`id` = 6 ORDER BY `microposts`.`created_at` DESC LIMIT 1

	def destroy
		@notifications = Notification.where(micropost_id: @micropost.id)
		if @notifications != nil
			@notifications.each do |notification|
				notification.destroy
			end
		end
		@micropost.destroy
---
SELECT `notifications`.* FROM `notifications` WHERE `notifications`.`micropost_id` = 5
DELETE FROM `notifications` WHERE `notifications`.`id` = 1
DELETE FROM `microposts` WHERE `microposts`.`id` = 5