app/controllers/sessions_controller.rb

	def creategoogle
  	 @user = User.find_or_create_from_auth_hash(request.env["omniauth.auth"])
  	if @user.save
---
INSERT INTO `users` (`name`, `email`, `created_at`, `updated_at`, `password_digest`, `provider`, `uid`, `avatar`) VALUES ('nguyễn ngọc', 'cutyremon@gmail.com', '2018-03-14 17:30:02', '2018-03-14 17:30:02', '$2a$10$6Urqj4J7XA.Og5TfVgrOeOUUoVrrcLNBM3Y9Qc9mjWoniTLQSOBKe', 'google_oauth2', '107030613243391027188', '/assets/images/fallback/ava-default-male.jpg')
UPDATE `users` SET `name` = 'nguyễn ngọcđông', `piture` = 'https://lh3.googleusercontent.com/-XdUIqdMkCWA/AAAAAAAAAAI/AAAAAAAAAAA/4252rscbv5M/photo.jpg', `password_digest` = '$2a$10$qhB0RrBaxdA5QcsErBLKxuY4D3e7uqPBS5lu7EoAA7iKISTdV2tyG', `updated_at` = '2018-03-15 02:48:56', `avatar` = '/assets/images/fallback/ava-default-male.jpg' WHERE `users`.`id` = 10

	def createfacebook
  	 @user = User.find_or_create_from_auth_hash_facebook(request.env["omniauth.auth"])
  	if @user.save
---
UPDATE `users` SET `name` = 'Đông', `piture` = 'http://graph.facebook.com/v2.6/931965166965967/picture', `password_digest` = '$2a$10$A/G0hKVKmXoGrtS4wk0Tmuqqpk2KFg4Od5ehT12Howw4a4n5ZqDda', `updated_at` = '2018-03-15 09:09:07', `avatar` = '27845819_957524234410060_1760911185_o.jpg' WHERE `users`.`id` = 9