app/controllers/users_controller.rb

SELECT  `users`.* FROM `users` WHERE (name like '%duong%') ORDER BY name ASC LIMIT 6 OFFSET 0
SELECT COUNT(*) FROM `users` WHERE (name like '%%')
---
  def index
    if (params[:search])
      @users = User.search(params[:search]).order('name ASC')
                   .paginate(page: params[:page], per_page: 6)

SELECT  `users`.* FROM `users` WHERE `users`.`id` = 14 LIMIT 1
SELECT `microposts`.* FROM `microposts` WHERE `microposts`.`user_id` = 14 ORDER BY `microposts`.`created_at` DESC
---
  def show
    @user = User.find(params[:id])
    @user1 = @user

    if params[:last_id]
      @microposts = @user.microposts.where("id < ? and user_id = ?",
                                           params[:last_id], @user.id)

INSERT INTO `users` (`name`, `email`, `gender`, `created_at`, `updated_at`, `password_digest`) VALUES ('aaa', 'duong123@gmail.com', 'Male', '2017-12-27 03:14:10', '2017-12-27 03:14:10', '$2a$10$kCaX21UL8xGpJxJ9mBJfJOTj/2ZhJe16Fr/J3WwRzVivHIt0NDwEq')
---
  def create
    @user = User.new(user_params)
    if @user.save

SELECT  `users`.* FROM `users` WHERE `users`.`id` = 14 LIMIT 1
UPDATE `users` SET `password_digest` = '$2a$10$BO0W/NkVU/P6CbLl4UBDz.SyqjEaYtiUEYb7EWnR/jI.zhF6FzrVu', `updated_at` = '2017-12-27 03:07:18' WHERE `users`.`id` = 14
---
  def update
    @user = User.find(params[:id])
    if @user.update_attributes(user_params)